Core/src/Documents/Импорт/Импорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Импорт</name>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <registerRecords>AccumulationRegister.СебестоимостьЗакупки</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоНалогам</registerRecords>
  <registerRecords>AccumulationRegister.Запасы</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерИмпортаA</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерИмпортаC</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидНалогаНДС</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидИмпорта</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>ДокументПоступления</name>
      <type>
        <types>DocumentRef.ПриходнаяНакладная</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентИмпорта</name>
      <type>
        <types>CatalogRef.ПроцентыИмпорта</types>
      </type>
    </attributes>
    <attributes>
      <name>БазаИмпорта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаИмпорта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПроцентаИмпорта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасходовНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СуммыРаспределения</name>
    <attributes>
      <name>СтавкаНалога</name>
      <type>
        <types>CatalogRef.ПроцентыИмпорта</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БазаИмпорта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/Documents/Импорт/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	СтратегияЗаполнения = Новый Соответствие;
	
	СтратегияЗаполнения[Тип("ДокументСсылка.ПриходнаяНакладная")] = "ОбработчикЗаполнения";
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);

	ЭтотОбъект.Ответственный = ЭтотОбъект.Автор;	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа
	Документы.Импорт.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета
	УправлениеНебольшойФирмойСервер.ОтразитьЗапасы(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьРасчетыПоНалогам(ДополнительныеСвойства, Движения, Отказ);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьХозрасчетный(ДополнительныеСвойства, Движения, Отказ);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьСебестоимостьЗакупки(ДополнительныеСвойства, Движения, Отказ);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

Процедура РаспределитьСуммуНДСПоСуммеНДС() Экспорт

	ИсхСуммаНДС = 0;
	БазаРаспределенияСумма = Запасы.Итог("Сумма");
	ВсегоНДСРасходы = СуммаНДС;
	
	Для каждого СтрокаЗапасы Из Запасы Цикл
		
		СтрокаЗапасы.СуммаРасходовНДС = ?(БазаРаспределенияСумма <> 0, Окр((ВсегоНДСРасходы - ИсхСуммаНДС) * СтрокаЗапасы.Сумма / БазаРаспределенияСумма, 2, 1),0);
		БазаРаспределенияСумма = БазаРаспределенияСумма - СтрокаЗапасы.Сумма;
		ИсхСуммаНДС = ИсхСуммаНДС + СтрокаЗапасы.СуммаРасходовНДС;
		
	КонецЦикла;	

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если СуммаНДС <> Запасы.Итог("СуммаРасходовНДС") Тогда 
		
		ТекстСообщения = НСтр("ka='მომსახურებების ჯამი მარაგებზე განაწილებული ჯამის ტოლი არ არის!';ru='Сумма НДС услуг не равна распределенной сумме по запасам!'");
		УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
			,
			ТекстСообщения,
			Неопределено,
			Неопределено,
			Неопределено,
			Отказ
		);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура РаспределитьСуммыИмпорта() Экспорт

	Для Каждого СтрСуммаПроцентов Из СуммыРаспределения Цикл 
		
		ИсхСумма = 0;
		БазаРаспределенияСумма = Запасы.Выгрузить(Новый Структура("ПроцентИмпорта", СтрСуммаПроцентов.СтавкаНалога)).Итог("БазаИмпорта");
		ВсегоИмпорт = СтрСуммаПроцентов.Сумма;
		
		Для Каждого СтрокаЗапасы Из Запасы Цикл
			
			Если СтрокаЗапасы.ПроцентИмпорта <> СтрСуммаПроцентов.СтавкаНалога Тогда 
				Продолжить;
			КонецЕсли;
			
			СтрокаЗапасы.СуммаИмпорта = ?(БазаРаспределенияСумма <> 0, Окр((ВсегоИмпорт - ИсхСумма) * СтрокаЗапасы.БазаИмпорта / БазаРаспределенияСумма, 2, 1),0);
			БазаРаспределенияСумма = БазаРаспределенияСумма - СтрокаЗапасы.БазаИмпорта;
			ИсхСумма = ИсхСумма + СтрокаЗапасы.СуммаИмпорта;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура РаспределитьСуммуНДСПоКоличеству() Экспорт

	Для Каждого СтрСуммаПроцентов Из СуммыРаспределения Цикл 
		
		ИсхСумма = 0;
		БазаРаспределенияКоличество = Запасы.Выгрузить(Новый Структура("ПроцентИмпорта", СтрСуммаПроцентов.СтавкаНалога)).Итог("Количество");
		ВсегоИмпорт = СтрСуммаПроцентов.Сумма;
		
		Для Каждого СтрокаЗапасы Из Запасы Цикл
			
			Если СтрокаЗапасы.ПроцентИмпорта <> СтрСуммаПроцентов.СтавкаНалога Тогда 
				Продолжить;
			КонецЕсли;
			
			СтрокаЗапасы.СуммаИмпорта = ?(БазаРаспределенияКоличество <> 0, Окр((ВсегоИмпорт - ИсхСумма) * СтрокаЗапасы.Количество / БазаРаспределенияКоличество, 2, 1),0);
			БазаРаспределенияКоличество = БазаРаспределенияКоличество - СтрокаЗапасы.Количество;
			ИсхСумма = ИсхСумма + СтрокаЗапасы.СуммаИмпорта;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработчикЗаполнения(ДанныеЗаполнения) Экспорт
	
	Если Не ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ОбщегоНазначения.ЗначениеСсылочногоТипа(ДанныеЗаполнения) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИмяТабличнойЧасти(ДанныеЗаполнения)) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатЗапроса = ЗапросДанныхДляЗаполнения(ДанныеЗаполнения).Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаШапка = РезультатЗапроса.Выбрать();
	ВыборкаШапка.Следующий();
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаШапка);
		
	ЭтотОбъект.Запасы.Очистить();
	ВыборкаТабличнаяЧасть = ВыборкаШапка[ИмяТабличнойЧасти(ДанныеЗаполнения)].Выбрать();
	Пока ВыборкаТабличнаяЧасть.Следующий() Цикл
		НовСтрок = ЭтотОбъект.Запасы.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрок, ВыборкаТабличнаяЧасть);
		НовСтрок.ДокументПоступления = ДанныеЗаполнения;
		НовСтрок.СтавкаНДС = НовСтрок.Номенклатура.СтавкаНДС;
		НовСтрок.ПроцентИмпорта = НовСтрок.Номенклатура.ПроцентИмпорта;
		НовСтрок.ЗначениеПроцентаИмпорта = НовСтрок.Номенклатура.ПроцентИмпорта.Ставка;
		НовСтрок.БазаИмпорта = НовСтрок.Сумма;		
	КонецЦикла;
	
	тзСтавок = СуммыРаспределения.Выгрузить();
	
	тзПроцентовИмпорта = Запасы.Выгрузить(,"ПроцентИмпорта");
	
	Для Каждого Строк Из тзПроцентовИмпорта Цикл 
		
		МассивНайденныхСтрокиПроцентов = тзСтавок.НайтиСтроки(Новый Структура("СтавкаНалога", Строк.ПроцентИмпорта));
		
		Если МассивНайденныхСтрокиПроцентов.Количество() = 0 Тогда 
			
			НовСтрока = тзСтавок.Добавить();
			НовСтрока.СтавкаНалога = Строк.ПроцентИмпорта;
			НовСтрока.Сумма = 0;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СуммыРаспределения.Загрузить(тзСтавок);
	
КонецПроцедуры

Функция ИмяТабличнойЧасти(ДанныеЗаполнения)
	
	ИменаТабличныхЧастей = Новый Соответствие;
	ИменаТабличныхЧастей[Тип("ДокументСсылка.ПриходнаяНакладная")] = "Запасы";
	
	Возврат ИменаТабличныхЧастей[ТипЗнч(ДанныеЗаполнения)];
	
КонецФункции

Функция ЗапросДанныхДляЗаполнения(ДанныеЗаполнения)
	
	Конструктор = Новый СхемаЗапроса;
	Пакет = Конструктор.ПакетЗапросов[0];
	Пакет.ВыбиратьРазрешенные = Истина;
	Оператор0 = Пакет.Операторы[0];
	Оператор0.Источники.Добавить(ДанныеЗаполнения.Метаданные().ПолноеИмя());
	Для Каждого ОписаниеПоляШапки Из ОписаниеПолейШапки(ДанныеЗаполнения) Цикл
		Оператор0.ВыбираемыеПоля.Добавить(ОписаниеПоляШапки.Ключ);
		Если ЗначениеЗаполнено(ОписаниеПоляШапки.Значение) Тогда
			Пакет.Колонки[Пакет.Колонки.Количество() - 1].Псевдоним = ОписаниеПоляШапки.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекОписаниеПоляТабличнойЧастиЗапасы Из ОписаниеПолейТабличнойЧастиЗапасы(ДанныеЗаполнения) Цикл
		Оператор0.ВыбираемыеПоля.Добавить(
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"%1.%2",
		ИмяТабличнойЧасти(ДанныеЗаполнения),
		ТекОписаниеПоляТабличнойЧастиЗапасы.Ключ));
		Если ЗначениеЗаполнено(ТекОписаниеПоляТабличнойЧастиЗапасы.Значение) Тогда
			Пакет.Колонки[Пакет.Колонки.Количество() - 1].Псевдоним = ТекОписаниеПоляТабличнойЧастиЗапасы.Значение;
		КонецЕсли;
	КонецЦикла;
			
	Оператор0.Отбор.Добавить("Ссылка = &Параметр");
	
	Результат = Новый Запрос(Конструктор.ПолучитьТекстЗапроса());
	Результат.УстановитьПараметр("Параметр", ДанныеЗаполнения);
	
	Возврат Результат;
	
КонецФункции

Функция ОписаниеПолейШапки(ДанныеЗаполнения)
	
	Результат = Новый Соответствие;
	
	ДанныеЗаполненияМетаданные = ДанныеЗаполнения.Метаданные();
	
	Результат.Вставить("Ссылка", "ДокументОснование");
	Результат.Вставить("Организация");
	Результат.Вставить("Организация.БанковскийСчетПоУмолчанию", "БанковскийСчет");
	
		
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьРеквизитЕслиОнЕстьВДокументе(РезультатСоответствие, ДанныеЗаполненияМетаданные, ИмяРеквизита)
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта(ИмяРеквизита, ДанныеЗаполненияМетаданные) Тогда
		РезультатСоответствие.Вставить(ИмяРеквизита);
	КонецЕсли;
	
КонецПроцедуры

Функция ОписаниеПолейТабличнойЧастиЗапасы(ДанныеЗаполнения)
	
	Результат = Новый Соответствие;
	//Результат.Вставить("ДокументПоступления");
	Результат.Вставить("Номенклатура");
	Результат.Вставить("Характеристика");
	Результат.Вставить("Количество");
	Результат.Вставить("ЕдиницаИзмерения");
	Результат.Вставить("Цена");
	Результат.Вставить("Сумма");
	Результат.Вставить("СтавкаНДС");
	//Результат.Вставить("БазаИмпорта");
	//Результат.Вставить("СуммаИмпорта");
	//Результат.Вставить("ЗначениеПроцентаИмпорта");
	Результат.Вставить("СуммаРасходовНДС");
	
	
	Возврат Результат;
	
КонецФункции
